## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.functions.google_storage_bucket_object.notification_source has been deleted
  - resource "google_storage_bucket_object" "notification_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/notification-39356179fd22dfbca0b15edc4ad17376.zip"
      - name             = "functions/notification-39356179fd22dfbca0b15edc4ad17376.zip" -> null
        # (14 unchanged attributes hidden)
    }

  # module.functions.google_storage_bucket_object.scoring_source has been deleted
  - resource "google_storage_bucket_object" "scoring_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-06b62758dacbca7654632d26e4729c0e.zip"
      - name             = "functions/scoring-06b62758dacbca7654632d26e4729c0e.zip" -> null
        # (14 unchanged attributes hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source has been deleted
  - resource "google_storage_bucket_object" "webhook_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-b21f5d0f7400b9501943a95152a4f8de.zip"
      - name             = "functions/webhook-b21f5d0f7400b9501943a95152a4f8de.zip" -> null
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.functions.data.archive_file.notification_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "notification_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/notification"
      + type                = "zip"
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.liff_join will be updated in-place
  ~ resource "google_cloudfunctions2_function" "liff_join" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/liff-join"
        name             = "liff-join"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-b21f5d0f7400b9501943a95152a4f8de.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_cloudfunctions2_function.notification will be updated in-place
  ~ resource "google_cloudfunctions2_function" "notification" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/notification"
        name             = "notification"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/notification-39356179fd22dfbca0b15edc4ad17376.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_memory                 = "512M" -> "256M"
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-06b62758dacbca7654632d26e4729c0e.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID" = "test" -> null
                # (3 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-b21f5d0f7400b9501943a95152a4f8de.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID"     = "test" -> null
                # (4 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_ACCESS_TOKEN" -> "LINE_CHANNEL_SECRET"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-access-token" -> "line-channel-secret"
                # (1 unchanged attribute hidden)
            }
          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_SECRET" -> "LINE_CHANNEL_ACCESS_TOKEN"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-secret" -> "line-channel-access-token"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.functions.google_storage_bucket_object.notification_source will be created
  + resource "google_storage_bucket_object" "notification_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.functions.google_storage_bucket_object.scoring_source will be created
  + resource "google_storage_bucket_object" "scoring_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.functions.google_storage_bucket_object.webhook_source will be created
  + resource "google_storage_bucket_object" "webhook_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 3 to add, 4 to change, 0 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
